/**
 * Разработать функтор, позволяющий собирать статистику о последовательности
 * целых чисел (последовательность может содержать числа от -500 до 500).
 *
 * Функтор после обработки последовательности алгоритмом for_each должен
 * предоставлять следующую статистику:
 *  1) Максимальное число в последовательности
 *  2) Минимальное число в последовательности
 *  3) Среднее число в последовательности
 *  4) Количество положительных чисел
 *  5) Количество отрицательных чисел
 *  6) Сумму нечетных элементов последовательности
 *  7) Сумму четных элементов последовательности
 *  8) Совпадают ли первый и последний элементы последовательности.
 *
 * 9) Проверить работу программы на случайно сгенерированных последовательностях
 */

////////////////////////////////
// Фомин С. (группа 23531/21) //
////////////////////////////////

#include <iostream>

using namespace std;

int main() {
    cout << "hw";
}